In [1]:
# 문제 1
data = { '학번':['2183101','2174125'],
         '이름':['홍길동','김경민'],
         'mid':[90,85],
         'final':[90,97]
       }

In [13]:
# 문제 2
import pandas as pd

df1 = pd.DataFrame(data)
df1

        학번   이름  mid  final
0  2183101  홍길동   90     90
1  2174125  김경민   85     97

In [14]:
# 문제 3
df1.set_index(['이름'], inplace=True)
df1

          학번  mid  final
이름
홍길동  2183101   90     90
김경민  2174125   85     97

In [4]:
# 문제 4
df1.columns = ['학번', '중간', '기말']
print(df1)

          학번  중간  기말
이름
홍길동  2183101  90  90
김경민  2174125  85  97

In [5]:
# 문제 5
df2 = pd.read_excel('./score.xlsx', header=None)
df2.columns = ['이름', '학번', '중간', '기말', '출석']
print(df2)

    이름        학번    중간   기말  출석
0  이영희  18831056  80.0   93  20
1  조성택  18831057  90.0   95  20
2  장영철  18831058   NaN  100  18
3  박남일  18831059  85.0   96  20
4  유상현  18831060  95.0   89  20
5  조성택  18831057  90.0   95  20

In [6]:
# 문제 6
df2.drop_duplicates(subset=['이름'], inplace=True)
df2.set_index(['이름'], inplace=True)
print(df2)

           학번    중간   기말  출석
이름
이영희  18831056  80.0   93  20
조성택  18831057  90.0   95  20
장영철  18831058   NaN  100  18
박남일  18831059  85.0   96  20
유상현  18831060  95.0   89  20

In [7]:
# 문제 7
df2['학번'] = df2['학번'].astype('str')
df2['기말'] = df2['기말'].astype('float')
print(df2.info())

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, 이영희 to 유상현
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   학번      5 non-null      object
 1   중간      4 non-null      float64
 2   기말      5 non-null      float64
 3   출석      5 non-null      int64
dtypes: float64(2), int64(1), object(1)
memory usage: 200.0+ bytes
None

In [8]:
# 문제 8
df2.drop(['출석'], axis=1, inplace=True)
print(df2)

           학번    중간     기말
이름
이영희  18831056  80.0   93.0
조성택  18831057  90.0   95.0
장영철  18831058   NaN  100.0
박남일  18831059  85.0   96.0
유상현  18831060  95.0   89.0

In [9]:
# 문제 9
df = pd.concat([df1,df2])
print(df)

           학번    중간     기말
이름
홍길동   2183101  90.0   90.0
김경민   2174125  85.0   97.0
이영희  18831056  80.0   93.0
조성택  18831057  90.0   95.0
장영철  18831058   NaN  100.0
박남일  18831059  85.0   96.0
유상현  18831060  95.0   89.0

In [10]:
# 문제 10
df['중간'].fillna(df['기말']*0.7, inplace=True)
print(df)

           학번    중간     기말
이름
홍길동   2183101  90.0   90.0
김경민   2174125  85.0   97.0
이영희  18831056  80.0   93.0
조성택  18831057  90.0   95.0
장영철  18831058  70.0  100.0
박남일  18831059  85.0   96.0
유상현  18831060  95.0   89.0

In [11]:
# 문제 11
df['성적'] = df['중간']+df['기말']
print(df)

           학번    중간     기말     성적
이름
홍길동   2183101  90.0   90.0  180.0
김경민   2174125  85.0   97.0  182.0
이영희  18831056  80.0   93.0  173.0
조성택  18831057  90.0   95.0  185.0
장영철  18831058  70.0  100.0  170.0
박남일  18831059  85.0   96.0  181.0
유상현  18831060  95.0   89.0  184.0

In [15]:
# 문제 12
def get_avg(grade):
    return grade / 2.0

df['학점'] = df['성적'].apply(get_avg)
print(df)

           학번    중간     기말     성적    학점
이름
홍길동   2183101  90.0   90.0  180.0  90.0
김경민   2174125  85.0   97.0  182.0  91.0
이영희  18831056  80.0   93.0  173.0  86.5
조성택  18831057  90.0   95.0  185.0  92.5
장영철  18831058  70.0  100.0  170.0  85.0
박남일  18831059  85.0   96.0  181.0  90.5
유상현  18831060  95.0   89.0  184.0  92.0